{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js v3.0.0",
    "convertedBy": "TensorFlow.js Converter v3.0.0",
    "modelTopology": {
      "backend": "tensorflow",
      "keras_version": "2.6.0",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 64,
                "activation": "relu",
                "use_bias": true
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 10,
                "activation": "softmax",
                "use_bias": true
              }
            }
          ]
        }
      },
      "training_config": {
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "learning_rate": 0.001,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-7,
            "amsgrad": false,
            "name": "Adam"
          }
        },
        "loss": "sparse_categorical_crossentropy",
        "metrics": [
          "accuracy"
        ]
      }
    }
  }
  